/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   export.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: efumiko <efumiko@student.21-school.ru>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/12/05 21:36:50 by efumiko           #+#    #+#             */
/*   Updated: 2020/12/05 22:28:20 by efumiko          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../minishell.h"

/**
 * Два случая - 1) есть аргументы, 2) нет аргументов
 * 2) Нет Аргументов:
 * 1. дублируем список envp
 * 2. сортируем его (функция сортировки)
 * 3. выводим, перед выводом приписываем declare -x (функция вывода)
 * 
 * 1)
 * 
 * 
*/

int ft_export(t_data *data)
{
    char **sorted_envp
    
    if (!data->args[1])
    {
        
    }
}